code-review/NRB_3471_3546/База_Стало/Reports/РасшифровкаПоДоходамДляНДИНДСРазбивкойПоРазделам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РасшифровкаПоДоходамДляНДИНДСРазбивкойПоРазделам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/РасшифровкаПоДоходамДляНДИНДСРазбивкойПоРазделам/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрыОтчета	= КомпоновщикНастроек.Настройки.ПараметрыДанных;
		
	Если ЗначениеЗаполнено(Поручение) Тогда
		ПараметрыОтчета.Элементы.Найти("ДатаНачала").Использование = Ложь;
		ПараметрыОтчета.Элементы.Найти("ДатаОкончания").Использование = Ложь;
	Иначе
		Если Не ЗначениеЗаполнено(ДатаНачала) И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
			ВызватьИсключение "Необходимо заполнить ""Период"" или ""Поручение"" для формирования отчета";
		КонецЕсли;
		ПараметрыОтчета.УстановитьЗначениеПараметра("ДатаНачала"	, ДатаНачала);
		ПараметрыОтчета.УстановитьЗначениеПараметра("ДатаОкончания"	, ДатаОкончания);
	КонецЕсли;
	
	ПараметрПоручение = ПараметрыОтчета.Элементы.Найти("Поручение");
	Если Не ПараметрПоручение = Неопределено Тогда
		ПараметрПоручение.Значение		= Поручение;
		ПараметрПоручение.Использование	= ЗначениеЗаполнено(Поручение);
	КонецЕсли;
	
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
